---
kind: other
id: Methods.T:Autodesk.Revit.DB.City
source: html/06716174-d722-ef21-8ec6-5046c1ba945e.htm
---
# City Methods

Causes the object to release immediately any resources it may be utilizing.